{
"recipes": 
[
 {  
"mood": "Cozy & Comforting",  
"name": "Vegetable Lo Mein", 
"description": "This classic Chinese dish features lo mein noodles, crisp-tender vegetables, and a savory sauce.", 
"prepTime": "25 minutes",
 "ingredients": ["1  tsp. canola oil", 
"1  tsp. minced garlic", 
"1  tsp. minced ginger", 
"3/4  cup carrots, cut into matchsticks", 
"3/4  cup broccoli florets", 
"3/4  cup snow peas", 
"1/3  cup vegetable broth", 
"2  Tbs. low-sodium soy sauce", 
"1  Tbs. cornstarch",
"9  oz. lo mein noodles"],
   "steps": [" Heat the oil in a large skillet over medium heat. Add the garlic, ginger, carrots, broccoli, and snow peas. Cook for 3 minutes, stirring occasionally.

Add the broth, soy sauce, and cornstarch; stir and cook for 1 minute.

Cook the noodles in boiling water according to package directions.

Drain the noodles; add to the skillet and stir until mixed.

Serve the Vegetable Lo Mein hot."]
}
,
{  
"mood": "Cozy & Comforting",  
"name": "Creamy Macaroni and Cheese", 
"description": "This classic macaroni and cheese is creamy and cheesy, and comforting.", 
"prepTime": "30 minutes",
 "ingredients": ["2  Tbs. butter", 
"2  Tbs. all-purpose flour", 
"2  cups milk", 
"1  tsp. garlic powder", 
"1/2  tsp. salt", 
"1/4  tsp. ground nutmeg", 
"2  cups grated sharp cheddar cheese", 
"1  cup grated Parmesan cheese",
"12  oz. elbow macaroni"],
   "steps": [" Preheat oven to 375 degrees F.

Melt butter in a large saucepan over medium heat. Add flour; whisk and cook for 1 minute.

Add milk, garlic powder, salt, and nutmeg; whisk until smooth. Increase heat to medium-high and continue to whisk until the sauce thickens, about 4 minutes.

Remove from heat and mix in 2 cups of cheddar cheese and the Parmesan.

Cook the macaroni in boiling water according to package directions.

Drain the macaroni and add it to the cheese sauce. Stir until mixed. Pour the mixture into a greased 2-quart baking dish.

Sprinkle the remaining 1 cup of cheddar cheese over the top.

Bake for 25 minutes, or until the sauce is bubbling and the cheese is melted and golden brown."]
}
,
{  
"mood": "Cozy & Comforting",  
"name": "Tomato Soup and Grilled Cheese",
"description": "This classic comfort food combo is the perfect cozy meal.", 
"prepTime": "20 minutes",
 "ingredients": ["2  Tbs. olive oil", 
"1  medium onion, diced", 
"1  garlic clove, minced", 
"2  cans (14.5 oz. each) diced tomatoes", 
"2  cups vegetable broth", 
"1  bay leaf", 
"1/2  tsp. dried oregano", 
"1/4  tsp. sugar", 
"1  loaf of Italian bread",
"1  lb. sliced cheddar cheese"],
   "steps": [" Heat the olive oil in a large saucepan over medium heat. Add the onion and garlic; sauté for 5 minutes.

Add the tomatoes, broth, bay leaf, oregano, and sugar. Simmer for 10 minutes.

Remove the bay leaf and blend the soup in a blender or food processor until smooth.

Toast the bread in a preheated 350 degree F oven for 5 minutes.

Top each piece of toast with 1/2 cup of cheddar cheese and a few slices of tomato.

Bake for 5 minutes, or until the cheese is melted.

Serve the Tomato Soup and Grilled Cheese warm with the toasted bread."]
}
,
{  
"mood": "Cozy & Comforting",  
"name": "Chicken Pot Pie", 
"description": "This classic dish is packed with tender chicken, veggies, and a creamy sauce, all topped with a flaky crust.", 
"prepTime": "50 minutes",
 "ingredients": ["1  Tbs. butter", 
"1  onion, diced", 
"2  celery stalks, diced", 
"2  carrots, diced", 
"2  cloves garlic, minced", 
"1  tsp. fresh thyme leaves", 
"1  Tbs. all-purpose flour", 
"2  cups chicken broth",
"3  cups cooked and shredded chicken"],
   "steps": [" Preheat oven to 375 degrees F.

Heat the butter in a large skillet over medium heat. Add the onion, celery, carrots, garlic, and thyme; sauté for 5 minutes.

Add the flour and stir for 1 minute.

Add the broth and bring to a simmer. Simmer for 5 minutes, stirring occasionally.

Add the chicken and cook for 3 minutes.

Transfer the mixture to a greased 9x13 baking dish.

Roll out a store-bought pie crust and place it on top of the dish, tucking the edges around the dish.

Bake for 25 minutes, or until the crust is golden brown."]
}
,
{  
"mood": "Cozy & Comforting", 
"name": "Shepherd’s Pie", 
"description": "This classic British dish is made with ground beef, vegetables, and a creamy mashed potato topping.", 
"prepTime": "1 hour",
 "ingredients": ["2  Tbs. butter", 
"1  onion, diced", 
"2  carrots, diced", 
"2  cloves garlic, minced", 
"1  tsp. fresh thyme leaves", 
"1  lb. ground beef", 
"1  Tbs. all-purpose flour", 
"1  tsp. Worcestershire sauce", 
"1  cup beef broth",
"5  cups cooked mashed potatoes"],
   "steps": [" Preheat oven to 375 degrees F.

Heat the butter in a large skillet over medium heat. Add the onion, carrots, garlic, and thyme; sauté for 5 minutes.

Add the beef and cook for 8 minutes, stirring occasionally, until browned.

Add the flour and stir for 1 minute.

Add the Worcestershire sauce and beef broth; stir and simmer for 5 minutes.

Transfer the beef mixture to a greased 9x13 baking dish.

Top the beef mixture with the mashed potatoes, spreading to the edges.

Bake for 25 minutes, or until golden brown and bubbling."]
}
,
{  
"mood": "Cozy & Comforting",  
"name": "Chicken Noodle Soup", 
"description": "This homemade soup is made with tender chicken, hearty noodles, and lots of vegetables.", 
"prepTime": "45 minutes",
 "ingredients": ["1  Tbs. olive oil", 
"1  onion, diced", 
"2  carrots, diced", 
"2  stalks celery, diced", 
"2  cloves garlic, minced", 
"1  tsp. fresh thyme leaves", 
"2  quarts chicken broth", 
"1  bay leaf", 
"1/2  tsp. salt", 
"1/4  tsp. pepper",
"2  cups cooked and shredded chicken"],
   "steps": [" Heat the olive oil in a large pot over medium heat. Add the onion, carrots, celery, garlic, and thyme; sauté for 5 minutes.

Add the broth, bay leaf, salt, and pepper; bring to a simmer.

Simmer for 20 minutes, stirring occasionally.

Add the chicken and cook for 5 minutes.

Remove the bay leaf and add the noodles; cook for 10 minutes, or until the noodles are tender.

Serve the Chicken Noodle Soup hot."]
}
,
{  
"mood": "Cozy & Comforting",  
"name": "Beef Stew", 
"description": "This classic stew is made with tender chunks of beef, potatoes, carrots, and other vegetables, and a savory broth.", 
"prepTime": "2 hours",
 "ingredients": ["2  Tbs. olive oil", 
"2  lb. beef chuck, cut into cubes", 
"1  onion, diced", 
"2  stalks celery, diced", 
"2  cloves garlic, minced", 
"2  tsp. tomato paste", 
"1  tsp. dried oregano", 
"1/2  tsp. dried thyme", 
"1  bay leaf",
"4  cups beef broth"],
   "steps": [" Heat the olive oil in a large pot over medium heat. Add the beef and cook for 8 minutes, stirring occasionally, until browned.

Add the onion, celery, garlic, tomato paste, oregano, thyme, and bay leaf; stir and cook for 5 minutes.

Add the broth and bring to a simmer. Simmer, covered, for 1 1/2 hours, stirring occasionally.

Add the potatoes and carrots; simmer for 30 minutes, or until the vegetables are tender.

Remove the bay leaf and serve the Beef Stew hot."]
}
,
{  
"mood": "Cozy & Comforting",  
"name": "Tacos", 
"description": "These classic tacos are flavorful, easy to make, and always comforting.", 
"prepTime": "15 minutes",
 "ingredients": ["1  lb. ground beef", 
"1  Tbs. chili powder", 
"1  tsp. ground cumin", 
"1/2  tsp. garlic powder", 
"1/2  tsp. onion powder", 
"1/4  tsp. ground black pepper", 
"1/4  tsp. cayenne pepper", 
"8  taco shells",
"1  cup shredded lettuce"],
   "steps": [" Heat a large skillet over medium heat. Add the beef and cook for 8 minutes, stirring occasionally, until browned.

Add the chili powder, cumin, garlic powder, onion powder, pepper, and cayenne; stir and cook for 1 minute.

Fill the taco shells with the beef mixture, lettuce, tomatoes, and cheese, and top with sour cream and salsa."]
}
,
{  
"mood": "Cozy & Comforting",  
"name": "Baked Apples", 
"description": "These sweet and cozy baked apples are filled with spiced fruit and nuts.", 
"prepTime": "45 minutes",
 "ingredients": ["4  large apples, cored and peeled", 
"1/2  cup raisins", 
"1/4  cup chopped walnuts", 
"1/4  cup packed brown sugar", 
"2  Tbs. butter, melted", 
"1  tsp. ground cinnamon", 
"1/2  tsp. ground nutmeg", 
"1/4  tsp. ground allspice",
"2  Tbs. maple syrup"],
   "steps": [" Preheat oven to 375 degrees F.

Place the cored apples in a greased 9x13 baking dish.

In a bowl, mix together the raisins, walnuts, sugar, butter, cinnamon, nutmeg, and allspice.

Fill the cored apples with the mixture. Drizzle the maple syrup over the top.

Bake for 35 minutes, or until the apples are tender.

Serve the Baked Apples warm."]
}
,
{  
"mood": "Cozy & Comforting",  
"name": "Biscuits and Gravy", 
"description": "This classic southern breakfast dish is made with flaky biscuits, creamy gravy, and lots of love.", 
"prepTime": "25 minutes",
 "ingredients": ["2  Tbs. butter", 
"2  Tbs. all-purpose flour", 
"2  cups milk", 
"1  tsp. garlic powder", 
"1/2  tsp. salt", 
"1/4  tsp. ground black pepper", 
"1/4  tsp. cayenne pepper",
"10  store-bought biscuit"],
   "steps": [" Melt the butter in a large saucepan over medium heat. Add the flour; whisk and cook for 1 minute.

Add the milk, garlic powder, salt,, pepper, and cayenne; whisk until smooth. Increase heat to medium-high and continue to whisk until the sauce thickens, about 4 minutes.

Cook the biscuits in a preheated 350 degree F oven according to package directions.

Serve the Biscuits and Gravy warm with the cooked biscuits."]
}
]
}