    - Characteristics: Light, lively, and invigorating.
    - Example Dishes: Grilled shrimp with corn salsa, Greek orzo pasta salad, quinoa bowl.

"recipes": 
[
 {  
"mood": "Cozy & Comforting",  
"name": "Meatball Stew", 
"description": "A hearty stew to warm you from the inside out", 
"prepTime": "30 mins",
 "ingredients": ["Ground beef","Carrots","Potatoes","Onion","Garlic","Tomato sauce","Beef broth","Thyme","Bay leaf","Salt & pepper"],
   "steps": [ "Prepare ingredients: Dice the carrots, onion, and garlic. Peel & cube the potatoes.","Heat 2 tablespoons of olive oil in a large pot over medium heat. Add the onion, carrots, and garlic. Cook for 5-7 minutes until softened.","Add the ground beef and break up the lumps. Cook, stirring occasionally until the beef is browned. Add in the tomato sauce and stir.","Pour in the beef broth and stir. Add the thyme, bay leaf, salt, and pepper. Bring to a boil.","Add in the potatoes and reduce heat to low. Simmer for 20-25 minutes until potatoes are softened.","Serve hot and enjoy!"]
},
{  
"mood": "Cozy & Comforting",  
"name": "Baked Macaroni & Cheese", 
"description": "A classic indulgent dish", 
"prepTime": "40 mins",
 "ingredients": ["Elbow macaroni","Butter","Flour","Salt & pepper","Milk","Cheddar cheese","Paprika"],
   "steps": [ "Preheat oven to 350°F.","Cook the macaroni until al dente in salted boiling water.","Melt the butter in a saucepan over medium heat. Add the flour and whisk to combine.","Continuously whisk the mixture for about 1 minute until it becomes bubbly and thickens slightly.","Pour in the milk and add salt & pepper. Stir to combine.","Bring the mixture to a simmer. Reduce heat to low and cook for 5 minutes or until the sauce has thickened.","Add in the shredded cheddar and stir until completely melted and creamy. Remove from heat.","Strain the cooked macaroni and place it in a baking dish.","Pour the cheese sauce over the macaroni and sprinkle with paprika.","Bake for 25 minutes or until browned on top.","Serve hot and enjoy!"]
},
{  
"mood": "Fresh & Vibrant",  
"name": "Grilled Shrimp with Corn Salsa", 
"description": "A light and fresh summer favorite", 
"prepTime": "25 mins",
 "ingredients": ["Shrimp","Lemon juice","Garlic powder","Olive oil","Salt & pepper","Cherry tomatoes","Corn kernels","Red onion","Cilantro leaves","Jalapeño","Lime juice","Olive oil"],
   "steps": [ "Prepare the shrimp: Place the shrimp in a large bowl and sprinkle with 1 tablespoon of lemon juice, garlic powder, and 2 tablespoons of olive oil. Season with salt & pepper and toss to combine.","In a separate bowl, combine the chopped tomatoes, corn, red onion, cilantro leaves, and jalapeño. Add 2 tablespoons of lime juice and 2 tablespoons of olive oil. Season with salt & pepper and toss for even distribution.","Heat a grill or grill pan over medium high heat. Place the shrimp on the grill pan and cook for 2-3 minutes per side, until the shrimp are opaque and pink.","Remove the shrimp from the grill and set aside.","Serve the grilled shrimp with the corn salsa. Enjoy!"]
},
{  
"mood": "Fresh & Vibrant",  
"name": "Greek Orzo Pasta Salad", 
"description": "A healthy & light pasta salad perfect for lunch or dinner", 
"prepTime": "35 mins",
 "ingredients": ["Orzo","English cucumber","Red onion","Kalamata olives","Feta cheese","Fresh parsley","Lemon juice","Olive oil","Salt & pepper"],
   "steps": [ "Cook the orzo according to package instructions until al dente. Drain and rinse with cold water.","In a large bowl, combine the cooked orzo, diced cucumber, red onion, kalamata olives, and feta cheese. Add the roughly chopped parsley.","In a small bowl, whisk together the lemon juice, olive oil, salt & pepper. Pour it over the orzo mix and stir to combine.","Refrigerate for 30 minutes before serving.","Serve cold and enjoy!"]
},
{  
"mood": "Cozy & Comforting",  
"name": "Chicken Pot Pie", 
"description": "A classic comfort food", 
"prepTime": "45 mins",
 "ingredients": ["Chicken thighs","Onion","Carrots","Celery","Garlic","Butter","All-purpose flour","Chicken broth","Milk","Thyme","Bay leaf","Salt & pepper","Puff pastry"],
   "steps": [ "Prepare the ingredients: Dice the onion, carrots, and celery. Mince the garlic.","Melt the butter in a large pot over medium heat. Add the onion, carrots, and celery and cook for 5-7 minutes until softened.","Add the minced garlic and cook for 1 minute longer. Sprinkle the all-purpose flour over the vegetables and mix to combine.","Gradually add in the chicken broth and whisk until combined. Add the milk, thyme, bay leaf, and salt & pepper. Bring to a boil.","Add in the chicken and reduce heat to low. Simmer for 15-20 minutes until the chicken is cooked through.","Preheat oven to 375°F.","Transfer the chicken pot pie filling to a pie dish. Cut out the puff pastry slightly larger than the pie dish and place it on top, pressing the edges to seal.","Bake for 25 minutes or until the crust is golden brown. Serve warm and enjoy!"]
},
{  
"mood": "Fresh & Vibrant",  
"name": "Quinoa Bowl", 
"description": "A versatile meal full of flavor and nutrition", 
"prepTime": "25 mins",
 "ingredients": ["Quinoa","Frozen corn","Bell pepper","Black beans","Garlic","Olive oil","Lime juice","Cilantro","Salt & pepper"],
   "steps": [ "Cook the quinoa according to package instructions.","Heat 2 tablespoons of olive oil in a large skillet over medium heat. Add the frozen corn, bell pepper, black beans, and minced garlic. Cook, stirring occasionally for about 5-7 minutes or until vegetables are softened.","Add the cooked quinoa to the skillet and mix until all is combined.","Remove from heat and stir in the lime juice, chopped cilantro, and salt & pepper.","Serve warm and enjoy!"]
},
{  
"mood": "Cozy & Comforting",  
"name": "Creamy Shepherd's Pie", 
"description": "A hearty and classic dish", 
"prepTime": "50 mins",
 "ingredients": ["Ground beef","Onion","Carrots","Peas","Garlic","Worcestershire sauce","Tomato paste","Beef broth","Butter","Flour","Milk","Mashed potatoes","Salt & pepper","Shredded cheddar"],
   "steps": [ "Prepare ingredients: Dice the onion, carrots, and garlic.","Preheat oven to 375°F.","Heat 2 tablespoons of olive oil in a large pot over medium heat. Add the onion, carrots, and garlic. Cook for 5-7 minutes until softened.","Add the ground beef and break up the lumps. Cook, stirring occasionally for about 5 minutes. Add the Worcestershire sauce and tomato paste and mix to combine.","Pour in the beef broth and mix to combine. Simmer for 10 minutes until thickened.","In a small saucepan, melt the butter then add the flour. Whisk to combine. Cook for 1 minute and whisk in the milk. Bring to a simmer and cook until thickened.","Once the beef is cooked, add the cooked peas and the white sauce. Stir to combine.","Transfer the beef and veggie mix to an oven safe dish. Spread the mashed potatoes over the top of the mixture.","Sprinkle with shredded cheddar cheese and season with salt & pepper. Bake for 25 minutes or until the cheese is melted and bubbly.","Serve warm and enjoy!"]
},
{  
"mood": "Fresh & Vibrant",  
"name": "Couscous Salad", 
"description": "A light and healthy salad bowl perfect for any occasion", 
"prepTime": "20 mins",
 "ingredients": ["Couscous","Red onion","Bell peppers","Kalamata olives","Feta cheese","Fresh parsley","Lemon juice","Olive oil","Salt & pepper"],
   "steps": [ "Cook the couscous according to package instructions.","In a large bowl, combine the cooked couscous, diced red onion, bell peppers, kalamata olives, and feta cheese. Add the roughly chopped parsley.","In a small bowl, whisk together the lemon juice, olive oil, salt & pepper. Pour it over the couscous mix and stir to combine.","Refrigerate for 10 minutes before serving.","Serve chilled and enjoy!"]
},
{  
"mood": "Cozy & Comforting",  
"name": "Beef Stew", 
"description": "A hearty and satisfying dish", 
"prepTime": "45 mins",
 "ingredients": ["Beef cubes","Carrots","Potatoes","Onion","Garlic","Tomato paste","Beef broth","Thyme","Bay leaf","Salt & pepper"],
   "steps": [ "Prepare ingredients: Dice the carrots, onion, and garlic. Peel & cube the potatoes.","Heat 2 tablespoons of olive oil in a large pot over medium heat. Add the onion, carrots, and garlic. Cook for 5-7 minutes until softened.","Add the beef cubes and break up the lumps. Cook, stirring occasionally until the beef is browned. Add in the tomato paste and stir.","Pour in the beef broth and stir. Add the thyme, bay leaf, salt, and pepper. Bring to a boil.","Add in the potatoes and reduce heat to low. Simmer for 20-25 minutes until potatoes are softened.","Serve hot and enjoy!"]
}
]